Autodesk.Revit.DB.DimensionEqualityLabelFormatting.IsValidFormatOptions
Checks whether a FormatOptions object is valid for the LabelType.
Remarks:
Only objects whose LabelType is LengthOfSegment or TotalLength can have FormatOptions assigned.
Returns:
True if the FormatOptions object is valid, false otherwise.
Since:
2017 Subscription Update

Autodesk.Revit.DB.DimensionEqualityLabelFormatting.SetFormatOptions(Autodesk.Revit.DB.FormatOptions)
Sets the format options used to show the parameter value.
formatOptions:
The format options to be set.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This DimensionEqualityLabelFormatting uses a LabelType which does not support assignment of FormatOptions.
Since:
2017 Subscription Update

Autodesk.Revit.DB.DimensionEqualityLabelFormatting.GetFormatOptions
Gets the format options used to show the parameter value.
Returns:
A copy of the format options.
Since:
2017 Subscription Update

Autodesk.Revit.DB.DimensionEqualityLabelFormatting.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.DimensionEqualityLabelFormatting.Suffix
The suffix to include after the parameter value.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2017 Subscription Update

Autodesk.Revit.DB.DimensionEqualityLabelFormatting.Prefix
The prefix to include before the parameter value.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2017 Subscription Update

Autodesk.Revit.DB.DimensionEqualityLabelFormatting.LeadingSpaces
The number of spaces to include before the parameter value.
Since:
2017 Subscription Update

Autodesk.Revit.DB.DimensionEqualityLabelFormatting.LabelType
The parameter value to be shown.
Since:
2017 Subscription Update

Autodesk.Revit.DB.DimensionEqualityLabelFormatting.#ctor(System.Int32,System.String,Autodesk.Revit.DB.LabelType,System.String,Autodesk.Revit.DB.FormatOptions)
Constructs a new instance of a DimensionEqualityLabelFormatting object with specified settings.
leadingSpaces:
The number of spaces to include before the parameter value.
prefix:
The prefix to include before the parameter value.
labelType:
The parameter value to be shown.
suffix:
The suffix to include after the parameter value.
formatOptions:
The format options to use for the parameter value.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2017 Subscription Update

Autodesk.Revit.DB.DimensionEqualityLabelFormatting
Instances of this class represent individual parameters used to make up a dimension equality formula for continuous linear or angular dimensions.
Since:
2017 Subscription Update